Documents/ПередачаМатериаловВЭксплуатацию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПередачаМатериаловВЭксплуатацию</Name>
			<Comment>Передача материалов в эксплуатацию</Comment>
			<BasedOn>
				<xr:Item>Document.ПеремещениеТоваров</xr:Item>
				<xr:Item>Document.ВозвратМатериаловИзЭксплуатации</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.МатериалыВЭксплуатации</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеБригады</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Бригады</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/МатериалыВЭксплуатации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>МатериалыВЭксплуатации</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеБригады</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Бригады</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ВозвратМатериаловИзЭксплуатации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ВозвратМатериаловИзЭксплуатации</Name>
			<Comment>Возврат материалов из эксплуатации</Comment>
			<BasedOn>
				<xr:Item>Document.ПередачаМатериаловВЭксплуатацию</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.МатериалыВЭксплуатации</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПередачаМатериаловВЭксплуатацию</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Возвращает</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеБригады</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Бригады</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПередачаМатериаловВЭксплуатацию/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
// КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//Расходная накладная
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати 	= "Документ.ПередачаМатериаловВЭксплуатацию";
    КомандаПечати.Идентификатор 	= "РасходнаяНакладная";
    КомандаПечати.Представление 	= НСтр("ru = 'Расходная накладная'");
	КомандаПечати.ЗаголовокФормы 	= НСтр("ru = 'Расходная накладная'");
	КомандаПечати.Порядок        	= 10;
			
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
// МассивОбъектов – Массив – ссылки на объекты, которые нужно распечатать;
// ПараметрыПечати – Структура – дополнительные настройки печати;
// КоллекцияПечатныхФорм – ТаблицаЗначений – сформированные табличные документы (выходной параметр)
// ОбъектыПечати – СписокЗначений – значение – ссылка на объект;
// представление – имя области, в которой был выведен объект (выходной параметр);
// ПараметрыВывода – Структура – дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РасходнаяНакладная") Тогда
         УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
        														КоллекцияПечатныхФорм,
        														"РасходнаяНакладная",
        														НСтр("ru = 'Расходная накладная'"),
        														СформироватьПечатнуюФормуТоварнойНакладной(МассивОбъектов, ОбъектыПечати));
    КонецЕсли;

КонецПроцедуры

Функция ПолучитьДанныеДляПечатныхФорм(МассивОбъектов) Экспорт
    
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Склад КАК Склад,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Организация.ПолноеНаименование = """"
	|			ТОГДА ДанныеДокумента.Организация.Наименование
	|		ИНАЧЕ ДанныеДокумента.Организация.ПолноеНаименование
	|	КОНЕЦ КАК ОрганизацияНаименование,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.Получатель КАК Контрагент
	|ИЗ
	|	Документ.ПередачаМатериаловВЭксплуатацию КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.Номенклатура.Артикул КАК Артикул,
	|	ДанныеДокумента.Номенклатура КАК Номенклатура,
	|	ДанныеДокумента.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ДанныеДокумента.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ДанныеДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДанныеДокумента.Коэффициент КАК Коэффициент,
	|	ДанныеДокумента.Количество КАК Количество,
	|	ЕСТЬNULL(МатериалыВЭксплуатацииОбороты.СуммаПриход, 0) КАК СуммаПриход,
	|	ЕСТЬNULL(МатериалыВЭксплуатацииОбороты.КоличествоПриход, 0) КАК КоличествоПриход,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(МатериалыВЭксплуатацииОбороты.КоличествоПриход, 0) = 0
	|			ТОГДА ЕСТЬNULL(МатериалыВЭксплуатацииОбороты.СуммаПриход, 0) / ЕСТЬNULL(МатериалыВЭксплуатацииОбороты.КоличествоПриход, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(МатериалыВЭксплуатацииОбороты.КоличествоПриход, 0) = 0
	|			ТОГДА ДанныеДокумента.Количество * (ЕСТЬNULL(МатериалыВЭксплуатацииОбороты.СуммаПриход, 0) / ЕСТЬNULL(МатериалыВЭксплуатацииОбороты.КоличествоПриход, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Сумма
	|ИЗ
	|	Документ.ПередачаМатериаловВЭксплуатацию.Товары КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.МатериалыВЭксплуатации.Обороты(, , Авто, ) КАК МатериалыВЭксплуатацииОбороты
	|		ПО (МатериалыВЭксплуатацииОбороты.Регистратор = ДанныеДокумента.Ссылка)
	|			И (МатериалыВЭксплуатацииОбороты.Номенклатура = ДанныеДокумента.Номенклатура)
	|			И (МатериалыВЭксплуатацииОбороты.ХарактеристикаНоменклатуры = ДанныеДокумента.ХарактеристикаНоменклатуры)
	|			И (МатериалыВЭксплуатацииОбороты.СерияНоменклатуры = ДанныеДокумента.СерияНоменклатуры)
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.НомерСтроки
	|ИТОГИ ПО
	|	Ссылка";
	
	МассивРезультатов         = Запрос.ВыполнитьПакет();
	РезультатПоШапке          = МассивРезультатов[0];
	РезультатПоТабличнойЧастиТовары = МассивРезультатов[1];
	РезультатПоСтоимости = МассивРезультатов[1];
	
	СтруктураДанныхДляПечати 	= Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧастиТовары",
	                                               РезультатПоШапке, РезультатПоТабличнойЧастиТовары);
	
	Возврат СтруктураДанныхДляПечати;
	
КонецФункции

Процедура ДополнитьДанныеДляПечатныхФорм(РезультатЗапроса, ВыборкаПоТоварам = Неопределено) Экспорт
	
	ОбщийМодульСервер.ДобавитьКолонкиКонтактнойИнформации(РезультатЗапроса);
	
	Для Каждого ТекущаяСтрока Из РезультатЗапроса Цикл
		
		ОбщийМодульСервер.ДополнитьДанныеДляПечатныхФормКонтактнойИнформацией(ТекущаяСтрока, ТекущаяСтрока.Организация);
		
	КонецЦикла;
	
КонецПроцедуры

Функция СформироватьПечатнуюФормуТоварнойНакладной(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина; //#14053
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПередачаМатериаловВЭксплуатацию_Накладная";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПередачаМатериаловВЭксплуатацию.ПФ_MXL_ТоварнаяНакладная");
	ВыводитьАртикул = Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить();
	
	СтруктураДанныхДляПечати = ПолучитьДанныеДляПечатныхФорм(МассивОбъектов);
	ТаблицаДанныеПечати = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();	
	ВыборкаПоТоварам = СтруктураДанныхДляПечати.РезультатПоТабличнойЧастиТовары.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати);
	
	ПервыйДокумент = Истина;
	Для Каждого ДанныеПечати Из ТаблицаДанныеПечати Цикл
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// №6171, чтобы можно было вывести свой заголовок с датой и номером
		СтруктураЗаголовка = новый Структура("Номер, Дата", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеПечати.Номер), Формат(ДанныеПечати.Дата, "ДЛф=Д"));
		ТекстЗаголовка = "Передача материалов в эксплуатацию №" + СтруктураЗаголовка.Номер + " от " + СтруктураЗаголовка.Дата;
		СтруктураЗаголовка.Вставить("ТекстЗаголовка", ТекстЗаголовка);
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			// №6171, чтобы можно было вывести свой заголовок с датой и номером
			//ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;		
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ОбластьМакета.Параметры.Заполнить(СтруктураЗаголовка);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Организация");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Получатель");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Склад");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		// Изменения размера колоноки, в зависимости от вывода Артикула
		Если Не ВыводитьАртикул Тогда
			Попытка
				Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки = Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки + Макет.Область("Артикул").ШиринаКолонки;
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Если ВыводитьАртикул Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Артикул");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Присоединить(ОбластьМакета);
			КонецЕсли;
			
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Присоединить(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		ИтогоСумма = 0;
		ИтогоКоличество = 0;
		
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
		ВыборкаПоТоварам.Сбросить();
		Если ВыборкаПоТоварам.НайтиСледующий(СтруктураПоиска) Тогда			
			Выборка = ВыборкаПоТоварам.Выбрать();			
			Пока Выборка.Следующий() Цикл
				
				Попытка
					ОбластьМакета = Макет.ПолучитьОбласть("Строка|НомерСтроки");
					ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
					ОбластьМакета.Параметры.Заполнить(Выборка);
					ТабличныйДокумент.Вывести(ОбластьМакета);
					
					Если ВыводитьАртикул Тогда
						ОбластьМакета = Макет.ПолучитьОбласть("Строка|Артикул");
						ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
						ОбластьМакета.Параметры.Заполнить(Выборка);
						ТабличныйДокумент.Присоединить(ОбластьМакета);
					КонецЕсли;
					
					ОбластьМакета = Макет.ПолучитьОбласть("Строка|Данные");
					ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
					ОбластьМакета.Параметры.Заполнить(Выборка);
					// №6171 представление формировать не нужно, сделаны отдельные колонки для характеристики и серии
					//ПредставлениеНоменклатуры = Строка(Товары.Номенклатура) + Строка(УправлениеПечатью.ПредставлениеХарактеристики(Товары.ХарактеристикаНоменклатуры));
					//ОбластьМакета.Параметры.Номенклатура = ПредставлениеНоменклатуры;
					
					//Отбор = Новый Структура;
					//Отбор.Вставить("Номенклатура",Выборка.Номенклатура);
					//Отбор.Вставить("ХарактеристикаНоменклатуры",Выборка.ХарактеристикаНоменклатуры);
					//Отбор.Вставить("СерияНоменклатуры",Выборка.СерияНоменклатуры);
					//НайденныеСтроки = ТаблицаСтоимости.НайтиСтроки(Отбор);
					//Если НайденныеСтроки.Количество() > 0 Тогда
					//	ОбластьМакета.Параметры.Цена = Окр(НайденныеСтроки[0].Цена,2);
					//	ОбластьМакета.Параметры.Сумма = Окр(Товары.Количество * НайденныеСтроки[0].Цена,2);
					//	ИтогоСумма = ИтогоСумма + Окр(Товары.Количество * НайденныеСтроки[0].Цена,2);
					//КонецЕсли;
					
					//++ №12909 только для номенклатуры, т.к. есть отдельные колонки для характеристики и серии
					ОбластьМакета.Параметры.Номенклатура = ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(Выборка.Номенклатура);
					//-- №12909
					
					ТабличныйДокумент.Присоединить(ОбластьМакета);
					
					ИтогоКоличество = ИтогоКоличество + Выборка.Количество;
					ИтогоСумма = ИтогоСумма + Выборка.Сумма;
				Исключение
				КонецПопытки;
			КонецЦикла;
		КонецЕсли;
		
		Попытка
			
			// №6171, заккоментировано, чтобы можно было вывести свои данные в подвал, переведено в структуру
			//ОбластьМакета.Параметры.Сумма = Сумма;
			//ОбластьМакета.Параметры.Количество = ИтогоКоличество;
			//ОбластьМакета.Параметры.Валюта = Константы.ВалютаУчета.Получить();
			//ОбластьМакета.Параметры.Отпустил = ОбщийМодуль.ФамилияИнициалы(Шапка.ОрганизацияОбъект.Руководитель.Наименование);
			
			СтруктураПодвала = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ДанныеПечати);			
			СтруктураПодвала.Вставить("Сумма", ИтогоСумма);
			СтруктураПодвала.Вставить("Количество", ИтогоКоличество);
			СтруктураПодвала.Вставить("Валюта", Константы.ВалютаУчета.Получить());
			СтруктураПодвала.Вставить("Отпустил", ОбщийМодуль.ФамилияИнициалы(ДанныеПечати.Организация.Руководитель.Наименование));
			ПодготовитьПаспортныеДанныеСотрудника(СтруктураПодвала, ДанныеПечати);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Итого|НомерСтроки");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ОбластьМакета.Параметры.Заполнить(СтруктураПодвала);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Если ВыводитьАртикул Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Итого|Артикул");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ОбластьМакета.Параметры.Заполнить(СтруктураПодвала);
				ТабличныйДокумент.Присоединить(ОбластьМакета);
			КонецЕсли;
			
			ОбластьМакета = Макет.ПолучитьОбласть("Итого|Данные");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ОбластьМакета.Параметры.Заполнить(СтруктураПодвала);
			ТабличныйДокумент.Присоединить(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ОбластьМакета.Параметры.Заполнить(СтруктураПодвала);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		Исключение
		КонецПопытки;
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати комплектов документов.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		
	КонецЦикла;
	
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	ТабличныйДокумент.ОтображатьСетку = Ложь;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

// №6171
Процедура ПодготовитьПаспортныеДанныеСотрудника(СтруктураДанных, Шапка)
	
	// заполняем только для сотрудника
	Если НЕ ТипЗнч(Шапка.Контрагент) = Тип("СправочникСсылка.Сотрудники") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураДанных.Вставить("ПаспортСерия",  			Шапка.Контрагент.ПаспортСерия);
	СтруктураДанных.Вставить("ПаспортНомер",  			Шапка.Контрагент.ПаспортНомер);
	СтруктураДанных.Вставить("ПаспортДатаВыдачи", 		Формат(Шапка.Контрагент.ПаспортДатаВыдачи, "ДЛф=Д"));
	СтруктураДанных.Вставить("ПаспортКемВыдан",  		Шапка.Контрагент.ПаспортКемВыдан);
	СтруктураДанных.Вставить("ПаспортКодПодразделения", Шапка.Контрагент.ПаспортКодПодразделения);
	СтруктураДанных.Вставить("ПаспортАдресРегистрации", Шапка.Контрагент.ПаспортАдресРегистрации);
	СтруктураДанных.Вставить("ИНН",  					Шапка.Контрагент.ИНН);
	СтруктураДанных.Вставить("КонтактныйТелефон",  		ОбщийМодульСервер.ПолучитьТелефонИзКонтактнойИнформации(Шапка.Контрагент));
	СтруктураДанных.Вставить("ДатаРождения",  			Шапка.Контрагент.ДатаРождения);
	СтруктураДанных.Вставить("ОсновнойEMail",  			ОбщийМодульСервер.ПолучитьЭлектроннуюПочтуИзКонтактнойИнформации(Шапка.Контрагент));
	
КонецПроцедуры	

#Область СозданиеНаОсновании

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Документы.ВозвратМатериаловИзЭксплуатации.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецПроцедуры

// Добавляет команду создания документа "Передача материалов в эксплуатацию".
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	Если ПравоДоступа("Добавление", Метаданные.Документы.ПередачаМатериаловВЭксплуатацию) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.ПередачаМатериаловВЭксплуатацию.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = Метаданные.Документы.ПередачаМатериаловВЭксплуатацию.Представление();
		КомандаСоздатьНаОсновании.РежимЗаписи = "Запись";
		
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
КонецФункции

#КонецОбласти

#КонецЕсли
